Repository: bfavrel/d7_so_listings
Catalog: translations/so_listings.*.po
Languages: fr

source: Listings general settings
fr: Paramètres généraux des listings

source: Allowed nodes types in listings
fr: Types de nodes autorisés dans les listings

source: Search forms default parameters
fr: Paramètres par défaut des moteurs de recherche

source: This settings will only affect new listings. For existing ones, settings have to be set manually in each individual form's parameters.
fr: Ces paramètres n'affecteront que les nouveaux listings. Pour ceux qui existent déjà, les paramètres doivent être appliqués manuellement dans chaque formulaire.

source: Submit buttons' label
fr: Label du bouton 'submit'

source: In english (it will be automatically translated at display)
fr: En anglais (traduit automatiquement à l'affichage)

source: Reset buttons' label
fr: Label du bouton 'reset'

source: Store values in user's session ?
fr: Stocker les valeurs dans la session utilisateur ?

source: Store values in database and provide an URL key ?
fr: Stocker les valeurs en base de données et fournir une clé d'URL ?

source: Use the 'advanced' form region ?
fr: Utiliser la région 'avancé' ?

source: Classes to apply to the forms
fr: Classes à appliquer aux formulaires

source: Separated by commas.
fr: Séparées par une virgule.

source: Override parameters of existing forms
fr: Supplanter les paramètres pour les formulaires existants

source: Prior to apply overridding, configuration has to be saved first.
fr: Avant d'appliquer la supplantation, la configuration doit avoir été sauvegardée.

source: Parameters to override
fr: Paramètres à supplanter

source: Buttons' labels
fr: Labels des boutons

source: Users' sessions values storage mode
fr: Mode de stockage des valeurs en session utilisateur

source: Database values storage mode and URL key provided
fr: Mode de stockage des valeurs en base de données et fourniture d'une clé d'URL

source: 'advanced' form region usage
fr: Utilisation de la région 'avancé' des formulaires

source: Forms' classes
fr: Classes des formulaires

source: Override
fr: Supplanter

source: Available display types
fr: Types d'affichage disponibles

source: Global presets switcher
fr: Switcher de preset global

source: If checked user preferences for a listing display will be reflected in all listings all over the site (since the selected preset is available for a given listing).
fr: Si coché, le choix d'un preset de listing par l'utilisateur sera répercuté sur tous les listings du site (dans la mesure où ce preset est disponible pour un listing donné).

source: Debug mode
fr: mode debug

source: Display SOL queries and results in Drupal messages zone.
fr: Affiche les requêtes SOL et les résultats dans la zone de messages Drupal.

source: Save configuration
fr: Enregistrer la configuration

source: Configuration has been saved.
fr: La configuration a été sauvegardée.

source: Search forms' parameters have been overrided.
fr: Les paramètres des formulaires ont été supplantés.

source: Contexts
fr: Contextes

source: Activation and priorities
fr: Activation et priorités

source: Higher priorities on top.<br />IMPORTANT : new contexts are discarded until this form is submitted.
fr: Les plus hautes priorités en haut.<br />IMPORTANT : les nouveaux contextes seront ignorés jusqu'à ce que ce formulaire soit soumis.

source: Save
fr: Enregistrer

source: View modes
fr: Modes d'affichage

source: New config label
fr: Etiquette de la nouvelle configuration

source: Add
fr: Ajouter

source: None (404)
fr: Aucune (404)

source: Unused
fr: Inutilisé

source: Delete
fr: Supprimer

source: Hard coded
fr: Codé en dur

source: Listings presets
fr: Presets des listings

source: configure
fr: configurer

source: delete
fr: supprimer

source: Name
fr: Nom

source: Machine name
fr: Nom système

source: Based on preset
fr: Basé sur le preset

source: Preset to copy parameters from.
fr: Preset à partir duquel copier les paramètres.

source: Preset id '@id' already exists.
fr: L'id de preset '@id' existe déjà.

source: Preset created.<br />It has to be configured now :
fr: Le preset a été créé.<br />Il doit maintenant être configuré :

source: '@preset' preset configuration
fr: Configuration du preset '@preset'

source: Must be in english. Will be processed by t() function later.
fr: En anglais. La fonction t() sera appliquée ultérieurement.

source: A short description of preset's features. These informations will be displayed as widget's display modes options.
fr: Courte description des caractéristiques du preset. Ces informations seront affichées comme options de mode d'affichage du widget.

source: Compilator settings
fr: Paramètres du compilateur

source: Number of results by page
fr: Nombre de résultats par page

source: '0' = all
fr: '0' = tous

source: Number maximum of results
fr: Nombre maximum de résultats

source: Listing is filtered by search engine
fr: Le listing est filtré par le moteur de recherche

source: Listing use sorting
fr: Le listing utilise le tri

source: Inform modules that preset has changed
fr: Informer les modules que le preset a changé

source: Back
fr: Retour

source: Preset configuration has been saved.
fr: La configuration du preset a été sauvegardée.

source: Are you sure you want to delete the preset '@preset' ?
fr: Êtes-vous sûr de vouloir supprimer les preset '@preset' ?

source: Preset '@preset' has been deleted
fr: Le preset '@preset' a été supprimé.

source: edit
fr: modifier

source: Are you sure you want to delete the listing '@listing' ?
fr: Êtes-vous sûr de vouloir supprimer le listing '@listing' ?

source: Listing '@listing' has been deleted
fr: Le listing '@listing' a été supprimé.

source: New listing basic parameters
fr: Paramètres de base du nouveau listing

source: None
fr: Aucun(e)

source: Based on listing
fr: Basé sur le listing

source: New listing's parameters will be duplicated from this listing.<br />Be carreful of some of these ones may be incompatible.
fr: Les paramètres du nouveau listing seront copiés à partir de ce listing.<br />Attentions, certains d'entre-eux sont suceptibles d'être incompatibles.

source: Create
fr: Créer

source: Listing '@listing' has been created.
fr: Le listing '@listing' a été créé.

source: Filters have to be set now, in order to listing can be displayed.
fr: Afin que le listing soit affiché, les filtres doivent être publiés.

source: Edit listing '@listing'
fr: Modification du listing '@listing'

source: Listing basic parameters
fr: Paramètres de base du listing

source: Listing '@listing' has been saved.
fr: Le listing '@listing' a été sauvegardé.

source: Data sources have changed. Filters have to be updated, in order to reflect the changes.
fr: Les sources de données ont été modifiées. Les filtres doivent être mis à jour afin de refléter les changements.

source: Sorting should be checked also.
fr: Les tris devraient être également contrôlés.

source: Only displayed in listings overviews and in selectbox of widget.
fr: Uniquement affiché dans la liste synthétique des listings, et dans la liste déroulante du widget.

source: Title
fr: Titre

source: Optionally displayed in rendered widget.
fr: Affiché dans le rendu du widget (optionnel).

source: Parent listing
fr: Listing parent

source: If checked, listing's nodes will be tied with this listing, even if they exist in another one.
fr: Si coché, les nodes de ce listing seront liés à celui-ci, même dans le cas où ces nodes existent dans un autre listing.

source: Nodes sources
fr: Sources des nodes

source: @module settings
fr: Paramètres de @module

source: Display a predefined listing of nodes.
fr: Affiche une liste prédéfinie de nodes.

source: Allowed presets
fr: Presets autorisés

source: Available display modes
fr: Mode d'affichage disponibles

source: If several display modes are selected, the first one will be used by default.<br />Users will be able to switch between them.
fr: Si plusieurs modes d'affichage sont sélectionnés, le premier sera utilisé par défaut.<br />Les utilisateurs auront la possibilité de basculer de l'un à l'autre.

source: must have the value
fr: doit avoir la valeur

source: Same case, same accents, etc.
fr: Même casse et même accents.

source: must be different from
fr: doit avoir une valeur différente de

source: must look like
fr: doit avoir une valeur qui ressemble à

source: Case and accents aren't considered.
fr: La casse et les accents ne sont pas pris en compte pour la comparaison.

source: mustn't look like
fr: ne doit pas avoir une valeur qui ressemble à

source: must start by the text
fr: doit avoir une valeur qui commence par

source: mustn't start by the text
fr: ne doit pas avoir une valeur qui commence par

source: must end by the text
fr: doit avoir une valeur qui finit par

source: mustn't end by the text
fr: ne doit pas avoir une valeur qui finit par

source: must contain the text
fr: doit avoir une valeur qui contient

source: mustn't contain the text
fr: ne doit pas avoir une valeur qui contient

source: must have at least one of theses values
fr: doit avoir au moins une de ces valeurs

source: Separated by comma.
fr: Séparés par des virgules.

source: mustn't have any of theses values
fr: ne doit avoir aucune de ces valeurs

source: must have at least all of theses values
fr: doit avoir au moins toutes ces valeurs

source: mustn't have this set of values
fr: ne doit pas avoir cet ensemble de valeurs

source: must be empty
fr: ne dois pas être renseigné

source: mustn't be empty
fr: doit être renseigné

source: must be greather than
fr: doit avoir une valeur supérieure à

source: must be greather or equal than
fr: doit avoir une valeur supérieure ou égale à

source: must be lower than
fr: doit avoir une valeur inférieure à

source: must be lower or equal than
fr: doit avoir une valeur inférieure ou égale à

source: start date
fr: date de début

source: end date
fr: date de fin

source: width
fr: largeur

source: height
fr: hauteur

source: The current set of filters has changed. It needs to be published to take effect.
fr: Le jeu de filtres courant a été modifié. Il doit être publié pour prendre effet.

source: Global filters
fr: Filtres globaux

source: Filters by data sources
fr: Filtres par sources de données

source: These sources have no common fields to filter
fr: Ces sources de données n'ont aucun champ en commun

source: Publish filters
fr: Publier les filtres

source: All
fr: Tout

source: Field
fr: Champ

source: Nodes' language
fr: Langage des nodes

source: Weight
fr: Poids

source: AND
fr: ET

source: OR
fr: OU

source: Filters have been applied on listing.
fr: Les filtres ont été appliqués au listing.

source: when the user views the page
fr: la date à laquelle l'utilisateur consulte la page

source: a fixed date
fr: une date fixe

source: shared
fr: partagé

source: Search results in this fields also
fr: Rechercher les résultats également dans ces champs

source: Results matching
fr: Correspondance des résultats

source: Results contain the term
fr: Les résultats contiennent le terme

source: Results start by the term
fr: Les résultats commencent par le terme

source: Results match the term
fr: Les résultats correspondent exactement au terme

source: Use autocompletion
fr: Utiliser l'autocomplétion

source: Minimum number of letters to type before triggering.<br />'0' = autocompletion disabled
fr: Nombre minimum de lettres à taper avant déclenchement.<br />'0' = autocomplétion désactivée

source: Results have to be...
fr: Les résultats doivent être...

source: equal at entered value
fr: égaux à la valeur entrée

source: different from entered value
fr: différents de la valeur entrée

source: lower than entered value
fr: inférieurs à la valeur entrée

source: lower or equal than entered value
fr: inférieurs ou égaux à la valeur entrée

source: greater than entered value
fr: supérieurs à la valeur entrée

source: greater or equal than entered value
fr: supérieurs ou égaux à la valeur entrée

source: Result mode
fr: Mode des résultats

source: Results have to match at least one selected option
fr: Les résultats doivent correspondre à au moins une des valeurs sélectionnés

source: Results have to match all selected options
fr: Les résultats doivent correspondre à toutes les valeurs sélectionnés

source: For a given selected option, results have to match its whole set of values
fr: Pour une option donnée, les résultats doivent correspondre à l'ensemble de ses valeurs

source: Options language
fr: Langue des options

source: Show the results which
fr: Montrer les résultats qui

source: have their both dates surrounding the searched period
fr: ont des dates encadrant la période recherchée

source: have at least their start date in the searched period
fr: ont au moins leur date de début dans la période recherchée

source: have at least their end date in the searched period
fr: ont au moins leur date de fin dans la période recherchée

source: have their both dates surrounded by the searched period
fr: ont leur deux dates encadrées par la période recherchée

source: last option results are necessarily included in those of its two preceding options.<br />Hence, it is only applicable as a constraint if they aren't checked.
fr: la dernière option incluant nécessairement les conditions des deux qui la précède, elle n'aura d'effet que si ces options sont décochées.

source: Random daily changing order
fr: Ordre aléatoire journalier

source: Sorting by fiche type (view modes)
fr: Tri par type de fiches (view modes)

source: Sorting
fr: Tri

source: Sorting by default
fr: Tri par défaut

source: Available clauses
fr: Clauses disponibles

source: Clause has been added.
fr: La clause a été ajoutée.

source: Clause has been removed.
fr: La clause a été enlevée.

source: Settings has been saved.<br />Listings have been updated.
fr: Les paramètres ont été sauvegardés.<br />Les listings ont été mis à jour.

source: Recompile static clauses/callbacks cache
fr: Recompiler le cache des clauses/callbacks statiques

source: Clauses and static callbacks results clauses need to be recompiled in cache when params change (ie : view modes).
fr: Les clauses et callbacks statiques ont besoin d'être recompilés en cache quand leurs paramètres ont changé (ex: les view modes).

source: When a new context is added/activated cache must also be rebuilt.
fr: Quand un nouveau contexte est ajouté/activé, le cache doit également être reconstruit.

source: Recompile
fr: Recompiler

source: Cache has been rebuilt
fr: Le cache a été reconstruit

source: Custom clauses
fr: Clauses personnalisées

source: Create a new clause
fr: Créer une nouvelle clause

source: Edit
fr: Modifier

source: Local
fr: Locale

source: Import
fr: Importer

source: Global
fr: Globale

source: Defined in
fr: Définie dans

source: Clause has been locally deleted, and its local usages have been removed
fr: La clause a été effacée localement et ses usage ont été supprimés.

source: Sorting in the '@context' context
fr: Tri dans le contexte '@context'

source: Publish sorting
fr: Publier le tri

source: Operation
fr: Opération

source: Use the instance of an existing set
fr: Utiliser l'instance d'un groupe existant

source: Duplicate an existing set
fr: Dupliquer un groupe existant

source: Use a custom set
fr: Utiliser un groupe personnalisé

source: No sorting
fr: Pas de tri

source: Context sorting to use
fr: Contexte de tri à utiliser

source: Use default settings
fr: Utiliser les paramètres par défaut

source: Context's sorting has been modified. Modifications will only take effect when published.
fr: Le tri de ce contexte a été modifié. Ces modifications ne prendront effet que lorsqu'il sera publié.

source: Nothing to duplicate.
fr: Rien à dupliquer.

source: Edit a sorting clause
fr: Editer une clause de tri

source: Select a field
fr: Sélectionner un champ

source: Clause name
fr: Nom de la clause

source: Clause direction (ascendant/descendant) should be explicitly mentioned
fr: La direction (ascendante/descendante) de la clause devrait être explicité.

source: No 'ORDER BY' prefix. Several clauses can be chained, as in a normal SQL 'ORDER BY' section.
fr: Pas de préfixe 'ORDER BY'. Plusieurs clause peuvent être chaînées, comme au sein d'un section 'ORDER BY' SQL normale.

source: (*) : field shared by whole sources
fr: (*) : champ partagé par l'ensemble des sources

source: Sorting in the '@context' context has been updated
fr: Le tri dans le contexte '@context' a été mis à jour

source: Clause has been saved
fr: La clause a été sauvegardée

source: Column(s)
fr: Colonne(s)

source: Values(s)
fr: Valeur(s)

source: Configure module
fr: Configurer le module

source: Edit module's settings.
fr: Editer les paramètres du module.

source: Administer listings
fr: Administrer les listings

source: Create and configure listings.
fr: Créer et configurer les listings

source: Administer listings' advanced features
fr: Administrer les fonctions avancées des listings

source: Edit advanced features like sorting custom clauses, etc.
fr: Editer les fonctionnalités avancées, telles que les clauses personnalisées de tris, etc.

source: Home
fr: Accueil

source: Change mode
fr: Changer de mode

source: default
fr: défaut

source: Default
fr: Par défaut

source: Display mode
fr: Mode d'affichage

source: Set view mode to '@vm'
fr: Paramétrer le view mode sur '@vm'

source: compacted
fr: Compact

source: expanded
fr: Expansé

source: Standard listing
fr: Listing standard

source: Standard search
fr: Recherche standard

source: Title by ascending alphabetical order
fr: Titre par ordre alphabétique ascendant

source: Title by descending alphabetical order
fr: Titre par ordre alphabétique descendant

source: Nodes of type
fr: Nodes du type

source: Display listing
fr: Afficher le listing

source: Nodes list display type (template)
fr: Type d'affichage des listes de nodes (template)

source: Use mode defined in each node
fr: Utiliser le mode défini pour chaque node

source: Nodes' view mode
fr: View mode des nodes

source: Display search form
fr: Afficher le moteur de recherche

source: Display listing's title
fr: Afficher le titre du listing

source: Use pager
fr: Utiliser un pager

source: Use AJAX
fr: Utiliser AJAX

source: Provide listing URL and breadcrumb infos to the standalone node
fr: Fournir l'URL du listing ainsi que les informations de breadcrumb aux nodes

source: General settings and presets
fr: Paramètres généraux et presets

source: Edit preset
fr: Modifier le preset

source: Edit listing
fr: Modifier le listing

source: Create a new listing
fr: Créer un nouveau listing

source: Parameters
fr: Paramètres

source: Filters
fr: Filtres

source: Search form
fr: Formulaire de recherche

source: Create a clause
fr: Créer une clause

source: Provides tools to create and display nodes listings. Defines the node type 'listing'.
fr: Fourni les outils nécessaire à la création et à l'affichage de listing de nodes. Défini le type de nodes 'listing'.

source: Defines the node type 'listing_block'. Such content type is intended to display listings in blocks.
fr: Défini le type de nodes 'listing_block'. Ce type de contenu permet d'afficher des listings dans des blocks.

source: Preset to use for listings
fr: Preset à utiliser pour les listings

source: Display time by node
fr: Temps d'affichage par node

source: in milliseconds
fr: en millisecondes

source: Settings have been saved.
fr: Les paramètres ont été sauvegardés.

source: Listing to display
fr: Listing a afficher

source: Page title to display
fr: Titre de page à afficher

source: If left empty, listing title will be used instead.
fr: Si vide, le titre du listing sera utilisé.

source: Show only items which have availabilities
fr: Ne montrer que les fiches qui ont des disponibilités

source: SO Listings kiosque settings
fr: Configuration de SO Listings Kiosque

source: Provides a listing actor type to Kiosque module.
fr: Fourni un acteur de type 'Listing' au module Kiosque.

source: @count result
fr: @count résultat

source: Label
fr: Étiquette

source: Operations
fr: Actions

source: Add a custom clause
fr: Ajouter une clause personnalisée

source: Add a clauses group
fr: Ajouter un groupe de clauses

source: No listing set yet
fr: Aucun listing

source: Usages
fr: Utilisations

source: all
fr: tout

source: Disable configuration for
fr: Désactiver la configuration pour

source: 'default' config will be used.
fr: La configuration 'default' sera utilisée.

source: System name : @name
fr: Nom système : @name

source: Config label
fr: Etiquette de la config

source: Pictogram
fr: Pictogramme

source: By default for
fr: Par défaut pour

source: No custom view modes set. 'teaser' will be used for listings, and 'full' for fiches
fr: Aucun view mode custom. 'accroche' sera utilisé pour les listings, et 'contenu complet' pour les fiches
