Repository: bfavrel/d7_so_listings
Catalog: modules/so_listings_weather/translations/so_listings_weather.*.po
Languages: fr

source: thunderstorm with light rain
fr: orage avec pluie

source: thunderstorm with rain
fr: orage avec pluie

source: thunderstorm with heavy rain
fr: orage avec de fortes pluies

source: light thunderstorm
fr: orage léger

source: thunderstorm
fr: orage

source: heavy thunderstorm
fr: orage violent

source: ragged thunderstorm
fr: orage

source: thunderstorm with light drizzle
fr: orage avec faible pluie

source: thunderstorm with drizzle
fr: orage avec pluie

source: thunderstorm with heavy drizzle
fr: orage avec forte pluie

source: light intensity drizzle
fr: bruine

source: drizzle
fr: bruine

source: heavy intensity drizzle
fr: forte bruine

source: light intensity drizzle rain
fr: bruine

source: drizzle rain
fr: bruine

source: heavy intensity drizzle rain
fr: bruine persistante

source: shower rain and drizzle
fr: pluie et bruine

source: heavy shower rain and drizzle
fr: forte pluie et bruine

source: shower drizzle
fr: bruine

source: light rain
fr: pluie fine

source: moderate rain
fr: pluie modérée

source: heavy intensity rain
fr: pluie forte

source: very heavy rain
fr: forte pluie

source: extreme rain
fr: pluie diluvienne

source: freezing rain
fr: pluie verglaçante

source: light intensity shower rain
fr: pluie

source: shower rain
fr: pluie

source: heavy intensity shower rain
fr: forte pluie

source: ragged shower rain
fr: forte pluie

source: light snow
fr: neige éparse

source: snow
fr: neige

source: heavy snow
fr: neige importante

source: sleet
fr: neige fondue

source: shower sleet
fr: neige fondue

source: light rain and snow
fr: pluie et neige légères

source: rain and snow
fr: pluie et neige

source: light shower snow
fr: neige

source: shower snow
fr: neige

source: heavy shower snow
fr: forte neige

source: mist
fr: brouillard

source: smoke
fr: brouillard épais

source: haze
fr: brume

source: sand, dust whirls
fr: sable, tourbillons de poussière

source: fog
fr: brouillard

source: sand
fr: sable

source: dust
fr: poussière

source: volcanic ash
fr: cendres volcaniques

source: squalls
fr: bourasques

source: tornado
fr: tornade

source: clear sky
fr: ciel dégagé

source: few clouds
fr: quelques nuages

source: scattered clouds
fr: nuages épars

source: broken clouds
fr: nuages épars

source: overcast clouds
fr: couvert

source: tropical storm
fr: tempête tropicale

source: hurricane
fr: ouragan

source: cold
fr: froid

source: hot
fr: chaud

source: windy
fr: venteux

source: hail
fr: grêle

source: calm
fr: temps calme

source: light breeze
fr: légère brise

source: gentle breeze
fr: légère brise

source: moderate breeze
fr: brise modérée

source: fresh breeze
fr: brise fraiche

source: strong breeze
fr: forte brise

source: high wind, near gale
fr: vent fort

source: gale
fr: grand vent

source: severe gale
fr: vent sévère

source: storm
fr: orage

source: violent storm
fr: orage violent

source: Configure module
fr: Configurer le module

source: Edit module's settings.
fr: Editer les paramètres du module.

source: Weather field
fr: Configuration météo

source: SO Listing Weather Element
fr: Elément de SO Listings Weather

source: Nomenclature used
fr: Nomenclature utilisée

source: No mapping
fr: Aucun mappage

source: Weather filter
fr: Filtrage météo

source: Realtime weather
fr: La météo en temps réel

source: Display only nodes which match
fr: N'afficher que les nodes qui correspondent à

source: Display also nodes which not have weather settings
fr: Afficher aussi les nodes qui n'ont pas de configuration enregistrée

source: Weather
fr: Météo

source: How to set ?
fr: Comment paramétrer ?

source: For exemple, for outdoor water activities, only 'good weather' should be checked.
fr: Par exemple, pour une activité aquatique en extérieur, seul 'beau temps' devrait être coché.

source: But a museum can be visited regardless of the weather. In this case all three weathers should be checked.
fr: Mais un musée peut être visité indépendamment de la météo. Dans ce cas, les trois types de temps devraient être cochés.

source: But, on another side, you could decide to provide a museum as filtering result only if weather is bad (as an alternative).
fr: D'un autre côté, vous pouvez décider de ne fournir le musée comme résultat du filtrage que si le temps est mauvais (comme une alternative).

source: It only depends on your own filtering policy.
fr: Cela ne dépend que de votre propre politique de filtrage.

source: Reference city
fr: Ville de référence

source: Suitable weather for this node
fr: Météo appropriée pour ce node

source: You can find detailed weather states nomenclature !link
fr: Vous pouvez consulter la nomenclature détaillée des états météo !link

source: here
fr: ici

source: Since this node is in default language, all its weather settings will be automatically duplicated in all its translations.
fr: Dans la mesure où ce node est en langage par défaut, tous ses paramètres météo seront automatiquement dupliqués dans toutes ses traductions.

source: API key
fr: Clé d'API

source: Get key !here
fr: Obtenez une clé !here

source: Reference city code
fr: Code de la ville de référence

source: Reference city label
fr: Label de la ville de référence

source: Add
fr: Ajouter

source: Launch weather update
fr: Lancer la mise à jour de la météo

source: Nodes types
fr: Types de nodes

source: Nodes types to filter
fr: Types de nodes à filtrer

source: Weather mappings
fr: Mappages des conditions

source: Save
fr: Enregistrer

source: Unknown
fr: Inconnu

source: Delete
fr: Supprimer

source: Good weather
fr: Beau temps

source: Middle weather
fr: Temps moyen

source: Bad weather
fr: Mauvais temps

source: No city set
fr: Aucune ville définie

source: City code
fr: Code de la ville

source: City
fr: Ville

source: Weight
fr: Poids

source: Current weather
fr: Météo actuelle

source: Unable to get data for city code : @code
fr: Impossible d'obtenir des données pour le code de ville : @code

source: Provides SO Listings functionalities to filter listings according to current weather.
fr: Fournit des fonctionnalités SO Listings pour filtrer les listings en fonction de la météo actualisée.
